In [1]:
from db import get_db_con, execute_query

In [2]:
con = get_db_con('vacancies.json')

In [3]:
query = """
WITH moscow_vacancies AS (
    SELECT DISTINCT
        vacancy_id
    FROM Locations
    WHERE location == 'moscow'
)

SELECT 
    position,
    AVG((salary_display_from + salary_display_to) / 2) AS avg_salary,
    COUNT(DISTINCT vacancy_id) AS uniq_vacanies
FROM Vacancies
WHERE vacancy_id IN (SELECT vacancy_id FROM moscow_vacancies)
GROUP BY 
    position
ORDER BY uniq_vacanies DESC
LIMIT 100
    
"""

execute_query(con, query)

                     position     avg_salary  uniq_vacanies
0          Системный аналитик  252525.641026             69
1              DevOps-инженер  287750.000000             46
2               Data Engineer  259225.000000             41
3             DevOps Engineer  275595.238095             35
4             Аналитик данных  307291.666667             32
..                        ...            ...            ...
95                Тестировщик  252500.000000              5
96             Тестировщик 1С  176666.666667              4
97  Site Reliability Engineer  325000.000000              4
98            Разработчик C++  360000.000000              4
99                    QA Lead  325000.000000              4

[100 rows x 3 columns]

In [4]:
execute_query(con, 'SHOW TABLES')

                name
0        Breadcrumbs
1    DisplayLocation
2          Locations
3  RelocationOptions
4             Skills
5    Specializations
6          Vacancies